# Load Dataset

In [5]:
import kagglehub
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [21]:

# Download latest version
path = kagglehub.dataset_download("halaturkialotaibi/coffee-bean-sales-dataset")

print("Path to dataset files:", path)
df = pd.read_csv(path + "/DatasetForCoffeeSales2.csv")

Path to dataset files: C:\Users\alfth\.cache\kagglehub\datasets\halaturkialotaibi\coffee-bean-sales-dataset\versions\2

In [22]:
df

,Date,Customer_ID,City,Category,Product,Unit Price,Quantity,Sales Amount,Used_Discount,Discount_Amount,Final Sales
0,1/1/2023,32,Riyadh,coffee beans,Colombian,40,14,560,False,0,560
1,1/2/2023,49,Abha,coffee beans,Costa Rica,35,17,595,False,0,595
2,1/3/2023,75,Tabuk,coffee beans,Costa Rica,35,19,665,False,0,665
3,1/4/2023,80,Abha,coffee beans,Ethiopian,45,1,45,False,0,45
4,1/5/2023,78,Hail,coffee beans,Colombian,40,46,1840,True,368,1472
...,...,...,...,...,...,...,...,...,...,...,...
725,12/26/2024,4,Hail,coffee beans,Colombian,40,26,1040,False,0,1040
726,12/27/2024,63,Mecca,coffee beans,Colombian,40,10,400,False,0,400
727,12/28/2024,39,Abha,coffee beans,Costa Rica,35,47,1645,False,0,1645
728,12/29/2024,57,Tabuk,coffee beans,Ethiopian,45,3,135,True,27,108
729,12/30/2024,50,Medina,coffee beans,Brazilian,30,33,990,True,198,792

## Jenis data dalam dataset

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date             730 non-null    object
 1   Customer_ID      730 non-null    int64
 2   City             730 non-null    object
 3   Category         730 non-null    object
 4   Product          730 non-null    object
 5   Unit Price       730 non-null    int64
 6   Quantity         730 non-null    int64
 7   Sales Amount     730 non-null    int64
 8   Used_Discount    730 non-null    bool
 9   Discount_Amount  730 non-null    int64
 10  Final Sales      730 non-null    int64
dtypes: bool(1), int64(6), object(4)
memory usage: 57.9+ KB

Analisis Jenis Dataset : 
- Time Series       : Kolom _Date_
- Category Nominal  : Kolom _City_,_Category_,_Product_
- Numerical         : Kolom _Customer ID_,_Unit Price_,_Quantity_,_Sales Amount_,_Used Discount_,_Discount Amount_,_Final Sales_

# EDA

In [24]:
df.head(10)

,Date,Customer_ID,City,Category,Product,Unit Price,Quantity,Sales Amount,Used_Discount,Discount_Amount,Final Sales
0,1/1/2023,32,Riyadh,coffee beans,Colombian,40,14,560,False,0,560
1,1/2/2023,49,Abha,coffee beans,Costa Rica,35,17,595,False,0,595
2,1/3/2023,75,Tabuk,coffee beans,Costa Rica,35,19,665,False,0,665
3,1/4/2023,80,Abha,coffee beans,Ethiopian,45,1,45,False,0,45
4,1/5/2023,78,Hail,coffee beans,Colombian,40,46,1840,True,368,1472
5,1/6/2023,1,Khobar,coffee beans,Colombian,40,32,1280,True,256,1024
6,1/7/2023,95,Buraidah,coffee beans,Brazilian,30,1,30,True,6,24
7,1/8/2023,27,Medina,coffee beans,Colombian,40,33,1320,False,0,1320
8,1/9/2023,73,Hail,coffee beans,Guatemala,35,47,1645,False,0,1645
9,1/10/2023,82,Dammam,coffee beans,Costa Rica,35,4,140,False,0,140

Filtering

In [25]:
df.filter(["City", "Category", "Product", "Quantity"]).head()

     City      Category     Product  Quantity
0  Riyadh  coffee beans   Colombian        14
1    Abha  coffee beans  Costa Rica        17
2   Tabuk  coffee beans  Costa Rica        19
3    Abha  coffee beans   Ethiopian         1
4    Hail  coffee beans   Colombian        46

Sorting

In [26]:
df.sort_values("Quantity", axis=0, ascending=False, inplace=True, na_position="last")
df.head()

,Date,Customer_ID,City,Category,Product,Unit Price,Quantity,Sales Amount,Used_Discount,Discount_Amount,Final Sales
15,1/16/2023,36,Jeddah,coffee beans,Ethiopian,45,49,2205,True,441,1764
355,12/22/2023,31,Buraidah,coffee beans,Brazilian,30,49,1470,False,0,1470
577,7/31/2024,65,Dammam,coffee beans,Colombian,40,49,1960,True,392,1568
149,5/30/2023,4,Abha,coffee beans,Costa Rica,35,49,1715,False,0,1715
696,11/27/2024,80,Buraidah,coffee beans,Colombian,40,49,1960,True,392,1568

Grouping

In [27]:
grp1 = df.groupby('City')
result = grp1['Final Sales'].aggregate('sum')
result

City
Abha        52831
Buraidah    56875
Dammam      59975
Hail        77257
Jeddah      72048
Khobar      59989
Mecca       66420
Medina      64813
Riyadh      68421
Tabuk       51019
Name: Final Sales, dtype: int64

# Load Dataset Baru

In [28]:
df = pd.read_csv('students.csv')

## Cleaning Data

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        975 non-null    object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                976 non-null    float64
 7   writing score                1000 non-null   int64
 8   grade                        985 non-null    float64
dtypes: float64(2), int64(2), object(5)
memory usage: 70.4+ KB

In [30]:
df.isnull().sum()

gender                          0
race/ethnicity                  0
parental level of education     0
lunch                          25
test preparation course         0
math score                      0
reading score                  24
writing score                   0
grade                          15
dtype: int64

In [31]:
df['lunch'].fillna(df['lunch'].mode()[0], inplace=True)

C:\Users\alfth\AppData\Local\Temp\ipykernel_29264\3755162539.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['lunch'].fillna(df['lunch'].mode()[0], inplace=True)

In [32]:
df['reading score'].fillna(df['reading score'].mean(), inplace=True)

C:\Users\alfth\AppData\Local\Temp\ipykernel_29264\596627207.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['reading score'].fillna(df['reading score'].mean(), inplace=True)

In [38]:
df['grade'].fillna(df['grade'].median(), inplace=True)

C:\Users\alfth\AppData\Local\Temp\ipykernel_29264\3620260582.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['grade'].fillna(df['grade'].median(), inplace=True)

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   float64
 7   writing score                1000 non-null   int64
 8   grade                        1000 non-null   float64
dtypes: float64(2), int64(2), object(5)
memory usage: 70.4+ KB

Teknik lain

In [41]:
df = pd.read_csv('students.csv')

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        975 non-null    object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                976 non-null    float64
 7   writing score                1000 non-null   int64
 8   grade                        985 non-null    float64
dtypes: float64(2), int64(2), object(5)
memory usage: 70.4+ KB

Interpolation

In [43]:
df['lunch'].interpolate(methode='linear', inplace=True)

C:\Users\alfth\AppData\Local\Temp\ipykernel_29264\1464395751.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['lunch'].interpolate(methode='linear', inplace=True)
C:\Users\alfth\AppData\Local\Temp\ipykernel_29264\1464395751.py:1: FutureWarning: Series.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df['lunch'].interpolate(methode='linear', inplace=True)

In [46]:

#backwardfill the missing value
df['reading score'].fillna(method= 'bfill', inplace = True)


#forwardfill the missing value
df['grade'].fillna(method= 'bfill', inplace = True)

C:\Users\alfth\AppData\Local\Temp\ipykernel_29264\3555708803.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['reading score'].fillna(method= 'bfill', inplace = True)
C:\Users\alfth\AppData\Local\Temp\ipykernel_29264\3555708803.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['grade'].fillna(method= 'bfill', inplace = True)
C:\Users\alfth\AppData\Local\Temp\ipykernel_29264\3555708803.py:6: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['grade'].fillna(method= 'bfill', inplace = True)

Dropping

In [47]:
df.dropna(inplace=True)